КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_ОписанияОпасныхГрузов/КонтурЛогистика_ОписанияОпасныхГрузов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтурЛогистика_ОписанияОпасныхГрузов</name>
  <attributes>
    <name>ТипДокумента</name>
    <comment>НПА</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерООН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НадлежащееОтгрузочноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТехническоеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Класс</name>
    <type>
      <types>EnumRef.КонтурЛогистика_КлассыОпасностиГрузов</types>
    </type>
  </attributes>
  <attributes>
    <name>КлассификационныйКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаУпаковки</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ГруппыУпаковки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗнакОпасности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОграниченияТуннели</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Радионуклиды</name>
    <comment>необязательное поле</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеФизХимФормы</name>
    <comment>необязательное поле</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксАктивностьРадиации</name>
    <comment>необязательное поле</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияУпаковки</name>
    <comment>необязательное поле</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортныйИндекс</name>
    <comment>необязательное поле</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИндексБезопасности</name>
    <comment>необязательное поле</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОпознавательныйЗнакСертификатов</name>
    <comment>Опознавательный знак для каждого сертификата об утверждении компетентного органа, применимый для данного груза</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолнаяАктивностьГруза</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбМасНетВзрСод</name>
    <comment>обязательно для класса 1</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбМасНетВзрСодВсех</name>
    <comment>обязательно для класса 1</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцСмеси</name>
    <comment>Дополнительные положения для класса 2.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИстеченияВремениУдержания</name>
    <comment>ДатИстВрУдер Дополнительные положения для класса 2.</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольнаяТемпература</name>
    <comment>Контрольная температура, в градусах</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АварийнаяТемпература</name>
    <comment>Аварийная температура, в градусах</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_ОписанияОпасныхГрузов/Forms/ДобавлениеЭлементовВКлассификатор/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Элементы.Классификатор.МножественныйВыбор = Истина;
	ЗакрыватьПриВыборе = Ложь;
	
	ЗаполнитьКлассификатор();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыКлассификатор

&НаКлиенте
Процедура КлассификаторВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДобавленыНовыеЭлементыКлассификатора = Ложь;
	ВыбранныйЭлемент = КлассификаторВыборНаСервере(ВыбраннаяСтрока, ДобавленыНовыеЭлементыКлассификатора);
	Если ВыбранныйЭлемент <> Неопределено Тогда
		ОповеститьФормуИПользователяИЗакрыть(ВыбранныйЭлемент, ДобавленыНовыеЭлементыКлассификатора);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КлассификаторВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДобавленыНовыеЭлементыКлассификатора = Ложь;
	ВыбранныйЭлемент = КлассификаторВыборНаСервере(Значение, ДобавленыНовыеЭлементыКлассификатора);
	Если ВыбранныйЭлемент <> Неопределено Тогда
		ОповеститьФормуИПользователяИЗакрыть(ВыбранныйЭлемент, ДобавленыНовыеЭлементыКлассификатора);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция КлассификаторВыборНаСервере(Знач ВыбранныеСтроки, ДобавленыНовыеЭлементыКлассификатора = Ложь)

	СсылкаНаЭлемент = Неопределено;
	
	МассивСсылок = Новый Массив();
	
	Если ТипЗнч(ВыбранныеСтроки) = Тип("Массив") Тогда
		
		Для Каждого ИдентификаторСтроки из ВыбранныеСтроки Цикл
			
			Элемент = Классификатор.НайтиПоИдентификатору(ИдентификаторСтроки);
			
			Если Не ЗначениеЗаполнено(Элемент.Ссылка) Тогда
				
				ДобавитьЭлементКлассификатора(Элемент);
				ДобавленыНовыеЭлементыКлассификатора = Истина;
				
			КонецЕсли;
			
			МассивСсылок.Добавить(Элемент.Ссылка);
			СсылкаНаЭлемент = Элемент.Ссылка;
			
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ВыбранныеСтроки) = Тип("Число") Тогда
		
		Элемент = Классификатор.НайтиПоИдентификатору(ВыбранныеСтроки);
		
		Если Не ЗначениеЗаполнено(Элемент.Ссылка) Тогда
			
			ДобавитьЭлементКлассификатора(Элемент);
			ДобавленыНовыеЭлементыКлассификатора = Истина;
			
		КонецЕсли;
		
		МассивСсылок.Добавить(Элемент.Ссылка);
		СсылкаНаЭлемент = Элемент.Ссылка;
		
	КонецЕсли;

	Если Подбор Тогда
		Возврат МассивСсылок;
	Иначе	
		Возврат СсылкаНаЭлемент;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// Классификатор
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("Классификатор");
	
	Элемент = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Классификатор.ЕстьСсылка");
	Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Элемент.ПравоеЗначение = Истина;
	Элемент.Использование = Истина;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветФонаВыделенияПоля);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьРанееДобавленныеЭлементы()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_ОписанияОпасныхГрузов.НомерООН КАК НомерООН,
	|	КонтурЛогистика_ОписанияОпасныхГрузов.Класс КАК Класс,
	|	КонтурЛогистика_ОписанияОпасныхГрузов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КонтурЛогистика_ОписанияОпасныхГрузов КАК КонтурЛогистика_ОписанияОпасныхГрузов";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Процедура ЗаполнитьКлассификатор()
	
	Классификатор.Очистить();
	
	// Получаем таблицу элементов классификатора уже имеющихся в справочнике.
	РанееДобавленныеЭлементыОписанияОпасныхГрузов = ПолучитьРанееДобавленныеЭлементы();
	РанееДобавленныеЭлементыОписанияОпасныхГрузов.Индексы.Добавить("НомерООН");
	РанееДобавленныеЭлементыОписанияОпасныхГрузов.Индексы.Добавить("Класс");
	
	ОписаниеОпасныхГрузов = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПолучитьТаблицуОписанияОпасныхГрузов();
	
	Если ОписаниеОпасныхГрузов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПоискаРанееСозданных = Новый Структура();
	
	Для Каждого Элемент Из ОписаниеОпасныхГрузов Цикл
		
		НоваяСтрока = Классификатор.Добавить();

		ЗаполнитьЗначенияСвойств(НоваяСтрока, Элемент);
		Если ЗначениеЗаполнено(НоваяСтрока.ГруппаУпаковки) = Ложь Тогда
			НоваяСтрока.ГруппаУпаковки = "-";
		КонецЕсли;	
		Если ЗначениеЗаполнено(НоваяСтрока.КодОграниченияТуннели) = Ложь Тогда
			НоваяСтрока.КодОграниченияТуннели = "-";
		КонецЕсли;
		Если ЗначениеЗаполнено(НоваяСтрока.КлассификационныйКод) = Ложь Тогда
			НоваяСтрока.КлассификационныйКод = "-";
		КонецЕсли;
		
		СтруктураПоискаРанееСозданных.Вставить("НомерООН", Элемент.НомерООН);
		СтруктураПоискаРанееСозданных.Вставить("Класс", Элемент.Класс);
		НайденныйЭлемент = РанееДобавленныеЭлементыОписанияОпасныхГрузов.НайтиСтроки(СтруктураПоискаРанееСозданных);
		
		Если НайденныйЭлемент.Количество() > 0 Тогда
			
			НоваяСтрока.Ссылка = НайденныйЭлемент[0].Ссылка;
			НоваяСтрока.ЕстьСсылка = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Классификатор.Сортировать("ЕстьСсылка Убыв, НомерООН Возр");
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЭлементКлассификатора(ВыбраннаяСтрока)
	
	ЭлементКлассификатора = Справочники.КонтурЛогистика_ОписанияОпасныхГрузов.СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(ЭлементКлассификатора, ВыбраннаяСтрока);
	ЭлементКлассификатора.Наименование = ЭлементКлассификатора.НадлежащееОтгрузочноеНаименование;
	ЭлементКлассификатора.ТипДокумента = "ДОПОГ";
	ЭлементКлассификатора.Записать();
	
	ВыбраннаяСтрока.Ссылка = ЭлементКлассификатора.Ссылка;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповеститьФормуИПользователяИЗакрыть(ВыбранныйЭлемент, ДобавленыНовыеЭлементыКлассификатора = Ложь)
	
	Если ДобавленыНовыеЭлементыКлассификатора Тогда
		ОповеститьОбИзменении(Тип("СправочникСсылка.КонтурЛогистика_ОписанияОпасныхГрузов"));
	КонецЕсли;
	
	ОповеститьОВыборе(ВыбранныйЭлемент);
	
КонецПроцедуры

#КонецОбласти
